// 题目描述
// Niven数的定义是这样的：如果一个数字能被它的各位数字之和整除，那么这个数就是Niven数。例如，111就是个Niven数，因为111的各位数字之和为3，而111能被3整除。我们也可以在其他进制b下来定义Niven数：如果一个b进制下的数能被它的各位数之和整除，那么它就是b进制下的Niven数。
// 给定b(2 <= b <= 10)和一个b进制下的数，判断该数是不是Niven数。
// 该问题包含多组测试数据。
// 第一行是个整数N，然后是N个输入块（每个输入块之间可能包括多组测试数据），之后是个空行。每个输入块包括两个数字。
// 输出N个输出块，每个输出块之间要输出个空行。
// 输入
// 第一行是个数字N，表示测试数据组数。每行包括进制b和一个非负的b进制下的整数。没有前导0。单个0表示输入结束。
// 输出
// 对于每个测试，如果该数是Niven数则输出“yes”，否则输出"no"。
// 样例输入 复制
// 1
// 10 111
// 2 110
// 10 123
// 6 1000
// 8 2314
// 0
// 样例输出 复制
// yes
// yes
// no
// yes
// no

#include<stdio.h>
int main(){
    int n;
    scanf("")
}