// 题目描述
// 颜色缩减就是把一组离散的颜色映射到一个较小范围的颜色上。解决这个问题需要提供一组标准的24位颜色空间中的一个映射。输入16个RGB颜色值作为目标集合。对于任意RGB颜色映射到这个集合中最接近的一个。为此，我们把一个RGB颜色定义为一个有序的三元组（R，G，B），其中每个值都是从0到255的整数。两种颜色之间的距离被定义为两个三维点之间的欧几里德距离。即给定的两种颜色（R1，G1，B1），（R2，G2，B2），它们的距离D由下式给出： D=sqrt((R2-R1) * (R2-R1)+(G2-G1) * (G2-G1)+(B2-B1) * (B2-B1))
// 输入
// 输入包括多个RGB颜色，每个颜色占一行，包括3个从0到255的整数，空格隔开。前16种颜色为需要映射的目标颜色。三个-1，表示输入结束。

// 输出
// 对于每种颜色，输出目标集最近的映射。如果有多个相同的最小距离，输出集合中最先出现的那个。
// 样例输入 复制
// 0 0 0
// 255 255 255
// 0 0 1
// 1 1 1
// 128 0 0
// 0 128 0
// 128 128 0
// 0 0 128
// 126 168 9
// 35 86 34
// 133 41 193
// 128 0 128
// 0 128 128
// 128 128 128
// 255 0 0
// 0 1 0
// 0 0 0
// 255 255 255
// 253 254 255
// 77 79 134
// 81 218 0
// -1 -1 -1
// 样例输出 复制
// (0,0,0) maps to (0,0,0)
// (255,255,255) maps to (255,255,255)
// (253,254,255) maps to (255,255,255)
// (77,79,134) maps to (128,128,128)
// (81,218,0) maps to (126,168,9)

#include<stdio.h>
#include<math.h>

int main(){
    int r[16],g[16],b[16];
    int x,y,z;
    for(int i=0;i<16;i++){
        scanf("%d %d %d",&r[i],&g[i],&b[i]);
    }
    while (scanf("%d %d %d",&x,&y,&z)!=EOF)
    {
        printf("(%d,%d,%d) maps to ",x,y,z);
        if(x==-1)return 0;
        int d,temp=0;
        d=sqrt(pow(x-r[0],2)+pow(y-g[0],2)+pow(z-b[0],2));
        for(int i=1;i<16;i++){
            if(d>sqrt(pow(x-r[i],2)+pow(y-g[i],2)+pow(z-b[i],2))){
                d=sqrt(pow(x-r[i],2)+pow(y-g[i],2)+pow(z-b[i],2));
                temp=i;
            }
        }
        printf("(%d,%d,%d)\n",r[temp],g[temp],b[temp]);
    }
    
    return 0;
}