// 题目描述
// 求2个浮点数相加的和。
// 题目中输入输出中出现浮点数都有如下的形式：
// P1P2...Pi.Q1Q2...Qj
// 对于整数部分，P1P2...Pi是一个非负整数
// 对于小数部分，Qj不等于0。
// 输入
// 第1行是测试数据的组数n，每组测试数据占2行，分别是两个加数。每组测试数据之间有一个空行，每行数据不超过100个字符。
// 输出
// n行，每组测试数据有一行输出是相应的和。输出保证一定是一个小数部分不为0的浮点数。
// 样例输入 复制
// 2
// 0.111111111111111111111111111111
// 0.111111111111111111111111111111

// 10000000.655555555555555555555555555555
// 1.444444444444444444444444444445
// 样例输出 复制
// 0.222222222222222222222222222222
// 10000002.1

#include<stdio.h>
#include<string.h>

int main(){
    int n;
    scanf("%d",&n);
    getchar();
    while(n--){
        char p[2][100]={'\0'},q[2][100]={'\0'},sum[400],temp[100];
        int t=0,h=0;
        while(h!=2){
            fgets(temp,sizeof(temp),stdin);
            int i=0,j=0;
            while(temp[i+j]!='\0'){
                if(temp[i]=='.'){
                    t=1;
                    i++;
                }
                else if(temp[i+j]=='\n'){
                        h++;
                        t=0;
                        break;
                }
                else {
                    if(t==0){
                        p[h][100-i-1]=temp[i];
                        i++;
                    }
                    else {
                        q[h][j]=temp[i];
                        j++;
                    }
                }
            }
            for(int k=0;k<100;k++){
                // 整数部分
                int z=0
                if()
                sum[400-2*k-1]=p[1][100-k-1]+p[2][100-k-1]+sum[400-2*k+1];
                if(sum[400-2*k-1]>'9'){
                    sum[400-2*k-1]=(sum[400-2*k-1]-'0')%10+'0';
                    sum[400-2*k-2]=(sum[400-2*k-1]-'0')/10+'0';
                }
            }

        }
        getchar();

    }
    return 0;
}